app/controllers/admin_controller.rb

  def login_validation
    redirect_if_admin

    @admin = Admin.new login_params
    if @admin.valid? :login
      @admin = Admin.find_by username: login_params['username']
---
SELECT  "admins".* FROM "admins" WHERE "admins"."username" = $1 LIMIT $2  [["username", "admin"], ["LIMIT", 1]]

  def recover_post
    @admin = Admin.new recover_user_params
    @admin.password = 'dummy_password'

    if @admin.valid? :recover
      @admin = Admin.find_by username: @admin.username
      if @admin.present?
---
SELECT  "admins".* FROM "admins" WHERE "admins"."username" = $1 LIMIT $2  [["username", "wisn"], ["LIMIT", 1]]

  def reset_password_validation
    if session[:admin_reset_password] != 'granted'
      redirect_to :admin_recover_root
    end

    @admin = Admin.new reset_password_params
    @admin.username = session[:admin_username]

    if @admin.valid? :reset_password
      password = @admin.password

      @admin = Admin.find_by(username: @admin.username)
      @admin.password = password

      if @admin.save
---
SELECT  "admins".* FROM "admins" WHERE "admins"."username" = $1 LIMIT $2  [["username", "admin"], ["LIMIT", 1]]
UPDATE "admins" SET "password_digest" = $1, "updated_at" = $2 WHERE "admins"."id" = $3  [["password_digest", "$2a$10$cKhRD5s2VcHg2wJswoiX8e5PFW2cqNZwmZUUJRb7aB.PrU41ine8W"], ["updated_at", "2018-12-03 18:15:34.699172"], ["id", 2]]

  def change_password_validation
    @admin = Admin.new reset_password_params
    @admin.username = session[:admin_username]

    if @admin.valid? :reset_password
      password = @admin.password

      @admin = Admin.find_by(username: @admin.username)
      @admin.password = password

      if @admin.save
---
SELECT  "admins".* FROM "admins" WHERE "admins"."username" = $1 LIMIT $2  [["username", "admin"], ["LIMIT", 1]]
UPDATE "admins" SET "password_digest" = $1, "updated_at" = $2 WHERE "admins"."id" = $3  [["password_digest", "$2a$10$KwCAtRCrxGNecijT4cpRfeBTLKLFkIBq6n0Wp6BLcWSqGKuvM8VEu"], ["updated_at", "2018-12-03 19:21:16.669502"], ["id", 2]]

  def dashboard
    redirect_if_not_admin

    @staff_total = Staff.count
    @books_total = Book.count
    @transactions_total = Transaction.count
---
SELECT COUNT(*) FROM "staffs"
SELECT COUNT(*) FROM "books"
SELECT COUNT(*) FROM "transactions"

  def manage_staff
    redirect_if_not_admin

    @staff = Staff.all
---
SELECT "staffs".* FROM "staffs"

  def new_staff_validation
    @staff = Staff.new new_staff_params
    if @staff.save context: :adds
---
INSERT INTO "staffs" ("fullname", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def edit_staff
    redirect_if_not_admin

    staff = Staff.find_by username: params[:username]
    if staff.present?
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."username" = $1 LIMIT $2  [["username", "ardia"], ["LIMIT", 1]]

  def edit_staff_validation
    username = params[:username]
    staff = Staff.find_by username: username
    if staff.present?
      params = edit_staff_params
      staff.fullname = params[:fullname]

      if params[:password] != ''
        staff.password = params[:password]
      end

      if staff.save context: :edits
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."username" = $1 LIMIT $2  [["username", "ardia"], ["LIMIT", 1]]
UPDATE "staffs" SET "password_digest" = $1, "updated_at" = $2 WHERE "staffs"."id" = $3  [["password_digest", "ardia2"], ["updated_at", "2018-12-03 21:31:36.556782"], ["id", 2]]

  def remove_staff
    staff = Staff.find_by username: params[:username]
    staff.delete if staff.present?
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."username" = $1 LIMIT $2  [["username", "ardia"], ["LIMIT", 1]]
DELETE FROM "staffs" WHERE "staffs"."id" = $1  [["id", 2]]