app/controllers/staff_controller.rb

  def login_validation
    redirect_if_staff

    @staff = Staff.new login_params
    if @staff.valid? :login
      @staff = Staff.find_by username: login_params['username']
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."username" = $1 LIMIT $2  [["username", "wisn"], ["LIMIT", 1]]

  def dashboard
    redirect_if_not_staff

    @visitors_total = Visitor.count
    @books_total = Book.count
    @transactions_total = Transaction.count
---
SELECT COUNT(*) FROM "visitors"
SELECT COUNT(*) FROM "books"
SELECT COUNT(*) FROM "transactions"

  def change_password_validation
    @staff = Staff.new change_password_params
    @staff.username = session[:user_data]['username']

    if @staff.valid? :reset_password
      password = @staff.password

      @staff = Staff.find_by username: @staff.username
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."username" = $1 LIMIT $2  [["username", "wisn"], ["LIMIT", 1]]

  def manage_visitor
    redirect_if_not_staff

    @visitor = Visitor.all
---
SELECT "visitors".* FROM "visitors"

  def new_visitor_validation
    @visitor = Visitor.new new_visitor_params
    if @visitor.save context: :adds
---
INSERT INTO "visitors" ("fullname", "username", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["fullname", "Irsyad Fauzan"], ["username", "irsyad"], ["age", 20], ["created_at", "2018-12-04 00:09:09.395910"], ["updated_at", "2018-12-04 00:09:09.395910"]]

  def edit_visitor
    redirect_if_not_staff

    visitor = Visitor.find_by username: params[:username]
---
SELECT  "visitors".* FROM "visitors" WHERE "visitors"."username" = $1 LIMIT $2  [["username", "pungki"], ["LIMIT", 1]]

  def edit_visitor_validation
    username = params[:username]
    visitor = Visitor.find_by username: username
    if visitor.present?
      params = edit_visitor_params
      visitor.fullname = params[:fullname]
      visitor.age = params[:age]

      if visitor.save context: :edits
---
SELECT  "visitors".* FROM "visitors" WHERE "visitors"."username" = $1 LIMIT $2  [["username", "pungki"], ["LIMIT", 1]]
UPDATE "visitors" SET "age" = $1, "updated_at" = $2 WHERE "visitors"."id" = $3  [["age", 21], ["updated_at", "2018-12-04 00:18:23.416166"], ["id", 1]]

  def remove_visitor
    visitor = Visitor.find_by username: params[:username]
    visitor.delete if visitor.present?
---
SELECT  "visitors".* FROM "visitors" WHERE "visitors"."username" = $1 LIMIT $2  [["username", "irsyad"], ["LIMIT", 1]]
DELETE FROM "visitors" WHERE "visitors"."id" = $1  [["id", 2]]

  def manage_book
    redirect_if_not_staff

    @book = Book.all
---
SELECT "books".* FROM "books"

  def new_book_validation
    @book = Book.new new_book_params
    if @book.save context: :adds
---
INSERT INTO "books" ("isbn", "title", "author", "synopsis", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit_book
    redirect_if_not_staff

    book = Book.find_by isbn: params[:isbn]
---
SELECT  "books".* FROM "books" WHERE "books"."isbn" = $1 LIMIT $2  [["isbn", "123456789"], ["LIMIT", 1]]

  def edit_book_validation
    isbn = params[:isbn]
    book = Book.find_by isbn: isbn
    if book.present?
      params = edit_book_params
      book.title = params[:title]
      book.author = params[:author]
      book.synopsis = params[:synopsis]

      if book.save context: :edits
---
SELECT  "books".* FROM "books" WHERE "books"."isbn" = $1 LIMIT $2  [["isbn", "123456789"], ["LIMIT", 1]]
UPDATE "books" SET "synopsis" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["synopsis", "Lorem ipsum blablablabla"], ["updated_at", "2018-12-04 01:06:34.987766"], ["id", 1]]

  def remove_book
    book = Book.find_by isbn: params[:isbn]
    book.delete if book.present?
---
SELECT  "books".* FROM "books" WHERE "books"."isbn" = $1 LIMIT $2  [["isbn", "123456780"], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]

  def manage_transaction
    redirect_if_not_staff

    @transaction = Transaction.all
---
SELECT "transactions".* FROM "transactions"

  def new_borrowing_validation
    if Visitor.find_by(username: transaction_params[:visitor_username]).present?
      if Book.find_by(isbn: transaction_params[:book_isbn]).present?
        @transaction = Transaction.new transaction_params
        @transaction.staff_username = session[:user_data]['username']
        @transaction.is_borrowing = true

        if @transaction.save context: :transaction
---
SELECT  "visitors".* FROM "visitors" WHERE "visitors"."username" = $1 LIMIT $2  [["username", "wisn"], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."isbn" = $1 LIMIT $2  [["isbn", "123"], ["LIMIT", 1]]
INSERT INTO "transactions" ("staff_username", "visitor_username", "book_isbn", "is_borrowing", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def new_returning_validation
    if Visitor.find_by(username: transaction_params[:visitor_username]).present?
      if Book.find_by(isbn: transaction_params[:book_isbn]).present?
        @transaction = Transaction.new transaction_params
        @transaction.staff_username = session[:user_data]['username']
        @transaction.is_borrowing = false

        if @transaction.save context: :transaction
---
SELECT  "visitors".* FROM "visitors" WHERE "visitors"."username" = $1 LIMIT $2  [["username", "wisn"], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."isbn" = $1 LIMIT $2  [["isbn", "123"], ["LIMIT", 1]]
INSERT INTO "transactions" ("staff_username", "visitor_username", "book_isbn", "is_borrowing", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"